12/data/attachments/6ed4261809335510.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_96faaca7-9f55-4475-aa2f-a65f87d7b536</nif:username>
            <nif:friendToBeAdded>Andrew_father_Actions_49079_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>